In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.randint(1,100,(4,6)),columns = list('ABCDEF'))

In [3]:
df

    A   B   C   D   E   F
0  31  80  26  83  14  89
1  74  19  18   2  50   1
2  96  94  43  77  14  80
3  79   8  87  89  77  63

### df.nlargest(x,'y')意为，将df中列名为y的列进行降序排列，并返回x行

In [4]:
df.nlargest(1,'A')

    A   B   C   D   E   F
2  96  94  43  77  14  80

In [5]:
df.nlargest(3,'B')

    A   B   C   D   E   F
2  96  94  43  77  14  80
0  31  80  26  83  14  89
1  74  19  18   2  50   1

In [6]:
s = pd.Series([True,False])
s1 = pd.Series([True,True])
s

0     True
1    False
dtype: bool

#### any()元素中一真为真，all（）元素中全真为真，一假为假

In [7]:
s.any()

True

In [8]:
s.all()

False

In [9]:
s1.any()

True

In [10]:
s1.all()

True

In [11]:
df

    A   B   C   D   E   F
0  31  80  26  83  14  89
1  74  19  18   2  50   1
2  96  94  43  77  14  80
3  79   8  87  89  77  63

#### query()的用法

#### query（）中只接受字符串

#### 将条件以字符串的形式写出来

In [12]:
df.query('B == 8')

    A  B   C   D   E   F
3  79  8  87  89  77  63

In [13]:
df[df.B == 8]

    A  B   C   D   E   F
3  79  8  87  89  77  63

In [14]:
df.query('A>B')

    A   B   C   D   E   F
1  74  19  18   2  50   1
2  96  94  43  77  14  80
3  79   8  87  89  77  63

In [15]:
df[df.A>df.B]

    A   B   C   D   E   F
1  74  19  18   2  50   1
2  96  94  43  77  14  80
3  79   8  87  89  77  63

#### reindex的用法，与之前索引不同的以空值填充，相同的，对应值不变

In [16]:
df1 = pd.DataFrame({'A':['1','2','3','4']})

In [17]:
df1

   A
0  1
1  2
2  3
3  4

In [18]:
df1.reindex(list('abcd'))

     A
a  NaN
b  NaN
c  NaN
d  NaN

In [19]:
df1.reindex(['a','b','c',3])

     A
a  NaN
b  NaN
c  NaN
3    4

In [20]:
df2 = pd.DataFrame(np.random.randint(5,8,(4,6)),columns = list('ABCDEF'))
df2

   A  B  C  D  E  F
0  7  6  6  6  5  6
1  7  5  7  5  6  6
2  5  5  7  6  7  7
3  5  6  5  5  5  7

#### 将C列的重复值所在的行删除

In [21]:
df2.drop_duplicates('C')

   A  B  C  D  E  F
0  7  6  6  6  5  6
1  7  5  7  5  6  6
3  5  6  5  5  5  7

In [22]:
a = [1,2,3,1,2,3,1,2,3,5]

In [28]:
for i in a:
    if a.count(i) == 1:
        print(i)

5

In [31]:
b = set(a)

In [32]:
a

[1, 2, 3, 1, 2, 3, 1, 2, 3, 5]

In [34]:
a.sort()

In [35]:
sorted(a)

[1, 1, 1, 2, 2, 2, 3, 3, 3, 5]

In [36]:
b = _

In [37]:
b

[1, 1, 1, 2, 2, 2, 3, 3, 3, 5]

In [59]:
b = [1,1,2,2,5,5,6]

In [90]:
d = {}
for i in b:
    if i in d:
        d[i] += 1
    else:
        d[i] = 1
print(min(d[d.values()]))

KeyError: dict_values([2, 2, 2, 1])

In [91]:
a = 'aaddgdsdfsa'
b = 'adfegdhdf'

In [92]:
if a in b:
    print(a)

In [94]:
for i in a:
    if i in b:
        print(i)

a
a
d
d
g
d
d
f
a

In [96]:
a = ['32452','342','545','2534']
a[2][1]

'4'